app/views/landing_page/_strategies_landing_show.html.erb

SELECT "authors".* FROM "authors" INNER JOIN "authors_strategies" ON "authors"."id" = "authors_strategies"."author_id" WHERE "authors_strategies"."strategy_id" = $1  [["strategy_id", 11]]
---
    <div class="col-md-3">
        <% strategy.authors.each do |author| %>