app/controllers/landing_page_controller.rb

SELECT  "strategies".* FROM "strategies"   ORDER BY created_at DESC LIMIT 20
---
  def landing
    @strategies=Strategy.all
    @strategiesOrdered = @strategies.order('created_at DESC').limit(20)

SELECT  "strategies".* FROM "strategies"   ORDER BY created_at DESC LIMIT 20
---
   def landing_corporate
    @strategies=Strategy.all
    @strategiesOrdered = @strategies.order('created_at DESC').limit(20)

SELECT  "strategies".* FROM "strategies"   ORDER BY created_at DESC LIMIT 20
---
  def landing_universities
    @strategies=Strategy.all
    @strategiesOrdered = @strategies.order('created_at DESC').limit(20)