app/controllers/strategies_controller.rb

    def set_strategy
      @strategy = Strategy.find(params[:id])
---
SELECT  "strategies".* FROM "strategies"  WHERE "strategies"."id" = $1 LIMIT 1  [["id", 10]]