app/views/strategies/index.html.erb

    <div class="col-sm-6 col-md-2">
        <% Author.where(id: strategy.authors.map(&:id)).each do |author| %>
---
SELECT "authors".* FROM "authors"  WHERE "authors"."id" IN (1)