app/views/strategies/show.html.erb


          <% @strategy.tips.order("created_at asc").each do |tip| %>
---
SELECT "tips".* FROM "tips"  WHERE "tips"."strategy_id" = $1  ORDER BY created_at asc  [["strategy_id", 10]]


        <% @strategy.authors.each do |author| %>
---
SELECT "authors".* FROM "authors" INNER JOIN "authors_strategies" ON "authors"."id" = "authors_strategies"."author_id" WHERE "authors_strategies"."strategy_id" = $1  [["strategy_id", 10]]